## Installation

Run below 2 commands for installation:
- !pip install pandas
- import pandas or import pandas as pd

- head
- tail
- loc
- iloc
- drop
- replace

There are 2 core data structure in pandas
1. Series: one dimensional array
2. DataFrame: two dimensional array, heterogenous tabuler data structure

## 1. Series

In [4]:
# Create a series
import pandas as pd

a = [11,22,33,44]
my_series = pd.Series(a)
my_series

0    11
1    22
2    33
3    44
dtype: int64

In [5]:
# access element using index

# 1.print first element
print(my_series[0])

11

In [6]:

# 2. print third element
print(my_series[2])

33

In [7]:
# You can pass your own index which will replace defaul index of 0,1,2....
index_series = pd.Series(a,index=["A","B","C","D"])
index_series

A    11
B    22
C    33
D    44
dtype: int64

In [11]:
# acees using new index
index_series["A"]

11

In [13]:
# acees using new index
index_series["C"]

33

#### Simple operations on series

In [14]:
# mean
my_series.mean()

27.5

In [15]:
#max
my_series.max()

44

In [16]:
#min
my_series.min()

11

In [17]:
#sum
my_series.sum()

110

## 2. DataFrame
- It is table with rows and columns

### 1. Create a dataframe

In [8]:
my_dict = {"name":["Rahul","Ketan","Ramesh","Amol"],
           "age":[23,35,30,20]}
my_dict

{'name': ['Rahul', 'Ketan', 'Ramesh', 'Amol'], 'age': [23, 35, 30, 20]}

In [9]:
df = pd.DataFrame(my_dict)
df

     name  age
0   Rahul   23
1   Ketan   35
2  Ramesh   30
3    Amol   20

### 2. read_csv
- just pass a path of CSV file
- pd.read_csv("Path_of_CSV_file")
- pd.read_excel("Path_of_CSV_file")

In [10]:
import pandas as pd
df = pd.read_csv("Bengaluru_House_Data.csv")
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

### 3. head and tail
- head return by default first 5 rows
- tail return by default last 5 rows

In [11]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [22]:
df.loc[[2,3,4],['location','total_sqft','price']]

             location total_sqft  price
2         Uttarahalli       1440   62.0
3  Lingadheeranahalli       1521   95.0
4            Kothanur       1200   51.0

In [16]:
df.tail()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [14]:
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

#### 4.INFO

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

#### 5. DESCRIBE

In [30]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

#### 6. shape

In [31]:
df.shape

(13320, 9)

#### 7. loc : label based indexing

In [17]:
my_dict = {"name":["Rahul","Ketan","Ramesh","Amol"],
           "age":[23,35,30,20]}
df1 = pd.DataFrame(my_dict,index=['AB','AC','DB','CD'])
df1

      name  age
AB   Rahul   23
AC   Ketan   35
DB  Ramesh   30
CD    Amol   20

In [47]:
# select single row
df1.loc['AC']

name    Ketan
age        35
Name: AC, dtype: object

In [49]:
# select multiple row
df1.loc[['AC','DB','CD']]

      name  age
AC   Ketan   35
DB  Ramesh   30
CD    Amol   20

In [20]:
# select row+column
df1.loc[['AC','DB','CD'],['name']]

      name
AC   Ketan
DB  Ramesh
CD    Amol

### 8. iloc : Integer-based indexing

In [23]:
df1

      name  age
AB   Rahul   23
AC   Ketan   35
DB  Ramesh   30
CD    Amol   20

In [24]:
# select single row
df1.iloc[-1]

name    Amol
age       20
Name: CD, dtype: object

In [25]:
# select single row
df1.iloc[0]

name    Rahul
age        23
Name: AB, dtype: object

In [26]:
# select multiple row
df1.iloc[[0,2,3]]

      name  age
AB   Rahul   23
DB  Ramesh   30
CD    Amol   20

In [29]:
# select multiple row
df1.iloc[[0,2,3],[1]]

    age
AB   23
DB   30
CD   20

### 9. Add Column

In [33]:
df["discount"] = 25

In [34]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price,discount
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07,25
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,25
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00,25
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00,25
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00,25

In [88]:
df["discount"] = df['price']*0.25

In [42]:
df.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,discount
0,Super built-up Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,25
1,Plot Area,Ready To Move,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,25
4,Super built-up Area,Ready To Move,2 BHK,NaN,1200,2.0,1.0,51.00,25
5,Super built-up Area,Ready To Move,2 BHK,DuenaTa,1170,2.0,1.0,38.00,25
6,Super built-up Area,18-May,4 BHK,Jaades,2732,4.0,NaN,204.00,25

#### 10. remove column

In [37]:
df.drop('location',axis=1,inplace=True)
# df.drop(columns=['location'],inplace=True)

In [41]:
## To remove row
df.drop([2,3],axis=0,inplace=True)

### 11. groupby

In [109]:
df.groupby('balcony')["price"].mean()

balcony
0.0    110.698469
1.0     85.730063
2.0    109.981948
3.0    150.748768
Name: price, dtype: float64

In [110]:
df.groupby('area_type')[["price",'total_sqft']].min()

                      price total_sqft
area_type
Built-up  Area         9.00       1000
Carpet  Area          13.00       1000
Plot  Area             8.44          1
Super built-up  Area   8.00       1000

In [43]:
df.groupby('area_type')[["price",'total_sqft']].max()

                       price total_sqft
area_type
Built-up  Area        2050.0        999
Carpet  Area           500.0        993
Plot  Area            3600.0        990
Super built-up  Area  2912.0        999

### 12. values_count

In [44]:
df["area_type"].value_counts()

area_type
Super built-up  Area    8789
Built-up  Area          2417
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

In [46]:
df["society"].value_counts()

society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64

#### 13. replace

In [47]:
df["area_type"].value_counts()

area_type
Super built-up  Area    8789
Built-up  Area          2417
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

In [48]:
df["area_type"].replace({"Super built-up  Area":"Super-built-up-Area",
                         "Built-up  Area":"Built-up-Area",
                         "Plot  Area":"Plot-Area",
                        "Carpet  Area":"Carpet-Area"},inplace=True)

In [49]:
df["area_type"].value_counts()

area_type
Super-built-up-Area    8789
Built-up-Area          2417
Plot-Area              2025
Carpet-Area              87
Name: count, dtype: int64

In [52]:
df["availability"].replace({"Ready To Move":"Ready Posession"},inplace=True)

In [53]:
df.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,discount
0,Super-built-up-Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,25
1,Plot-Area,Ready Posession,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,25
4,Super-built-up-Area,Ready Posession,2 BHK,NaN,1200,2.0,1.0,51.00,25
5,Super-built-up-Area,Ready Posession,2 BHK,DuenaTa,1170,2.0,1.0,38.00,25
6,Super-built-up-Area,18-May,4 BHK,Jaades,2732,4.0,NaN,204.00,25

### 14. apply

In [54]:
df.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,discount
0,Super-built-up-Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,25
1,Plot-Area,Ready Posession,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,25
4,Super-built-up-Area,Ready Posession,2 BHK,NaN,1200,2.0,1.0,51.00,25
5,Super-built-up-Area,Ready Posession,2 BHK,DuenaTa,1170,2.0,1.0,38.00,25
6,Super-built-up-Area,18-May,4 BHK,Jaades,2732,4.0,NaN,204.00,25

In [56]:
def discount_count(price):
    if price>50:
        return 75
    elif price<50:
        return 25

In [58]:
discount_count(20)

25

In [59]:
df["new_discount"] = df["price"].apply(discount_count)

In [60]:
df.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,discount,new_discount
0,Super-built-up-Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,25,25.0
1,Plot-Area,Ready Posession,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,25,75.0
4,Super-built-up-Area,Ready Posession,2 BHK,NaN,1200,2.0,1.0,51.00,25,75.0
5,Super-built-up-Area,Ready Posession,2 BHK,DuenaTa,1170,2.0,1.0,38.00,25,25.0
6,Super-built-up-Area,18-May,4 BHK,Jaades,2732,4.0,NaN,204.00,25,75.0